{
    "type": "UFOSightings",
    "features": [
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [34.0293,-94.7391]
            },

            "properties": {
                "location": "Broken Bow, OK",
                 "description": "Silent trapezoid (triangle with its head cut off). Oklahoma, 1971. One fairly clear evening (~8:45) at dusk, in the summer of 1971, my brother (11) and I (male, 13) visited our 3 friends [Female(14), female (12) and male (8)], who had relocated from the Houston area the previous summer. We were outside Broken Bow, OK. We were west (~5 miles) and somewhat south of the city and in a very rural area. We were walking north to see their church at night -- an exciting/scary thing to do! The birds had stopped singing and the crickets had not yet started, so it was very quite. I noticed that there were three lights toward Broken bow that were not blinking. I asked if they had any towers out there and they said they didn't know. And something was mentioned about their living in that particular location (on rural acreage in a mobile home) only since December (~7 months). So we just kept walking toward the church. About a minute or so later, we looked up to see a very large opaque trapezoid (triangle with its head cut off) with three lights. It was moving very slowly toward the sun that had already set. The narrow end of the trapezoid led and the wide end followed. It blocked out the atmospheric haze that was still aglow because the sun was not quite completely gone. It continued westward until it was obscured by the wooded area to the west of us. The lights were as such, two in the front on each corner and one in the north corner only. I do not remember their colors. The amazing thing is that it made no noise. There is no way to be certain of its size/height, although if I had to guess, since I thought the lights were towers, then it must not have been too high, assuming it maintained its height. If it was that height, I'd guess it to be about 1/3 the size of a football field.  I was elated to hear about the one in Phoenix in the 1990's. Although it was chevron-shaped, and had more lights, like ours, it was hovering, expansive and silent. I assume the aliens have changed their designs over the years; either out of boredom or out of necessity, scientific or economic - gotta keep up with the Joneses-Snergabloids. LOL. ((NUFORC Note:  Witness indicates that the date of the event is approximate.  PD))"
            }

        }
    ]
}